Breeder_1.5/solvers/other/IcoStructFoam/icoStructFoamTest/0/region2/D
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volVectorField;
    object          Udisp;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    bottom
    {
        type            tractionDisplacement;
        traction        uniform (0 0 0);
        pressure        uniform 0;
        value           uniform (0 0 0);
     }	

    top
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }

    inlet
    {
//        type            tractionDisplacement;
//        traction        uniform (0 0 0);
//        pressure        uniform 0;
	type 		fixedValue;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            tractionDisplacement;
        traction        uniform (0 0 0);
        pressure        uniform 0;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
