Breeder_1.5/solvers/other/IcoStructFoam/icoStructFoamTest/constant/region1/dynamicMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          motionProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoDMotion      yes;

//solver          laplaceTetDecomposition;

//diffusion       quadratic patchEnhanced;

//frozenDiffusion off;

//distancePatches 
//(
//);
dynamicFvMesh dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");
// motionSolverLibs ("libfvMotionSolvers.dylib");

solver displacementLaplacian;

diffusivity  uniform;


// ************************************************************************* //
