Breeder_1.5/solvers/other/IcoStructFoam/icoStructFoamTest/system/region1/fvSchemes
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

d2dt2Schemes
{
    default     steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(Udisp)         leastSquares;
    grad(T)         leastSquares;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear;
    div(sigma)      Gauss linear;
}

laplacianSchemes
{
    default         none;
    laplacian(nu,U) Gauss linear corrected;
    laplacian((1|A(U)),p) Gauss linear corrected;
    laplacian(DUdisp,Udisp) Gauss linear corrected;
    laplacian(DT,T) Gauss linear corrected;
    laplacian(diffusivity,cellMotionU)  Gauss linear uncorrected;
    laplacian(diffusivity,cellDisplacement)  Gauss linear uncorrected;
}

interpolationSchemes 
{
    default         linear;
    interpolate(HbyA) linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
    Udisp;
    T;
}


// ************************************************************************* //
